import { InfoI } from "../../types/info.types";

export const INFO_LIST: InfoI[] = [
    {
        title: "سوابق شغلی",
        list: [
            {
                title: "برنامه‌نویس سیستم، رایانکار پیشرو دانش، تهران (دورکاری) - تمام وقت",
                from: "آبان ۱۴۰۲", // November 2023
                to: "فروردین ۱۴۰۴",     // Present
                works: [
                    "پیاده‌سازی یک راهکار WebRTC Routing با Rust با بهره‌گیری از XDP برای packet interception (layers 2-4) و یک dynamic call registry از طریق Unix sockets.",
                    "ایجاد یک API Gateway با استفاده از Rust برای جایگزینی سرویس AWS مورد استفاده شرکت.",
                    "تدریس کلاس‌های برنامه‌نویسی Rust به کارمندان شرکت.",
                    "نوشتن یک کتابخانه Dynamic HID برای ارسال دستورات و دریافت رویدادها از هدست‌های متصل به دستگاه، با استفاده از Rust و نوشتن یک SDK به زبان <bdi>C#</bdi> که با استفاده از FFI ارتباط برقرار می‌کند."
                ],
            },
            {
                title: "توسعه‌دهنده فرانت‌اند، رایانکار پیشرو دانش، تهران (دورکاری) - تمام وقت",
                from: "شهریور ۱۴۰۲", // September 2023
                to: "آبان ۱۴۰۲",    // November 2023
                works: [
                    "ادامه کار بر روی پلتفرم ارتباطی با استفاده از Angular.",
                    "نوشتن wrapper برای SIP.js جهت کار در Blazor.",
                    "توسعه ویژگی‌های تماس برای یک وب‌اپلیکیشن نوشته شده با Blazor."
                ],
            },
            {
                title: "توسعه‌دهنده فرانت‌اند، رایانکار پیشرو دانش، تهران (دورکاری) - پاره وقت",
                from: "اردیبهشت ۱۴۰۲", // May 2023
                to: "شهریور ۱۴۰۲",   // September 2023
                works: [
                    "توسعه یک پلتفرم ارتباطی با استفاده از Angular.",
                    "نوشتن تست‌های e2e و ایجاد بک‌اند mock برای تست‌ها با Nestjs."
                ],
            },
            {
                title: "توسعه‌دهنده فرانت‌اند، های‌وب، تهران - تمام وقت",
                from: "بهمن ۱۳۹۹",   // January 2021
                to: "شهریور ۱۴۰۲", // September 2023
                works: [
                    "ایجاد یک وب‌سایت برای باشگاه فوتبال استقلال با استفاده از Angular و StencilJS.",
                    "ایجاد یک کتابخانه UI با استفاده از StencilJS تا توسعه‌دهندگان شرکت بتوانند از کامپوننت‌ها هم در React و هم در Angular استفاده کنند.",
                    "افزودن ویژگی‌ها و به‌روزرسانی یک وب‌سایت ثبت‌نام سفر که با Angular ساخته شده بود.",
                    "بازسازی وب‌سایت خبری با Nextjs.",
                    "ایجاد یک کتابخانه React به نام flawless-ui برای سرعت بخشیدن به توسعه و حذف خطاهای رایج برای پروژه‌های شرکت و انتشار آن در NPM.",
                    "مدیریت و ادامه توسعه یک وب اپلیکیشن پلتفرم خدمات ورزشی و رفاهی. (SELFiT)",
                    "ایجاد وب‌سایت برای بیمه فردا با استفاده از Nextjs، Typescript و Tailwind.",
                    "ایجاد یک پنل برای بیمه دانا با استفاده از Nextjs، Typescript و Material UI.",
                    "انتقال پروژه به React با Vite به گونه‌ای که پنل بتواند برای چندین شرکت بیمه با UIهای کاملاً متفاوت اما ویژگی‌ها و عملکردهای یکسان از یک سورس کد واحد استفاده شود.",
                    "ایجاد یک ویجت (white label) برای خرید بلیت سینما با استفاده از React، Tailwind و Rust.",
                    "ایجاد یک وب‌سایت برچسب‌گذاری (labelling) و data annotation برای یادگیری ماشین (ML) با استفاده از React، WASM و Rust.",
                    "ایجاد یک اپلیکیشن مالی PWA با Reactjs، Typescript، Vite و Tailwind."
                ],
            },
            {
                title: "پشتیبانی آنلاین، صباایده، تهران",
                from: "اردیبهشت ۱۳۹۹", // May 2020
                to: "آبان ۱۳۹۹",    // November 2020
                works: [
                    "پشتیبان آنلاین آپارات لایو.",
                    "به دلیل کرونا از خانه کار می‌کردم (دورکاری).",
                    "ساعت کاری از ۶ بعد از ظهر تا ۱۲ شب در روزهای کاری بود، همچنین باید به تمام پیام‌های کاربران در آخر هفته‌ها و تعطیلات پاسخ می‌دادم.",
                    "در اوقات فراغت مشغول یادگیری توسعه وب بودم.",
                    "کار را برای مطالعه تمام وقت توسعه وب و یافتن شغل به عنوان توسعه‌دهنده وب ترک کردم."
                ],
            },
            {
            title: "فریلنس و پروژه‌های شخصی",
            from: "آبان ۱۳۹۸", // November 2019
            to: "تاکنون",     // Present
            works: [
                "ساخت وب‌سایت با استفاده از expressjs برای شرکت صادرات پسته (۱۳۹۸)",
                "ساخت یک الگوریتم سریع برای جستجوی کلمات در متن برای بررسی پیام‌های چت در وب‌سایت‌های استریم بازی (۱۴۰۰)",
                "ارائه الگوریتم با استفاده از Nestjs، MongoDB و Redis به صورت API برای استفاده توسط شرکت‌ها و افراد (۱۴۰۰)",
                "ساخت یک وب اپلیکیشن ثبت پژوهش برای دانشگاه علوم پزشکی هرمزگان با استفاده از Nestjs، MongoDB، Nextjs و Material UI <bdi>(۱۴۰۱)</bdi>",
                "بازنویسی الگوریتم جستجوی متن و سرویس با Golang و gRPC. <bdi>(۱۴۰۱)</bdi>",
                "توسعه بک‌اند برای یک اپلیکیشن پارک‌یاب کراس پلتفرم با استفاده از Rust و MongoDB <bdi>(۱۴۰۳)</bdi>",
                "نوشتن کد bare-metal با استفاده از Rust بدون هیچ کتابخانه‌ای بر روی Cortex-M4(STM32F303VC) برای درخواست تحقیق و توسعه (R&D) (۱۴۰۴)",
            ],
        },
        ],
    },
    {
        title: "دوره‌های کارآموزی",
        list: [
            {
                title: "اپراتور NOC، های‌وب، تهران",
                from: "خرداد ۱۳۹۷",  // June 2018
                to: "شهریور ۱۳۹۷", // September 2018
                works: [
                    "به عنوان کارآموز در مرکز عملیات شبکه (NOC) کار کردم و دوره <bdi>Network+</bdi> را در تابستان قبل از ورود به دانشگاه گذراندم.",
                    "همچنین برای چند هفته قبل از رفتن به دانشگاه به عنوان پشتیبانی مشتری و فروشنده کار کردم."
                ],
            }
        ],
    },
    {
        title: "تحصیلات",
        list: [
            {
                title: "مهندسی کامپیوتر، دانشگاه آزاد اسلامی، واحد تهران مرکزی، تهران",
                from: "شهریور ۱۳۹۷", // September 2018
                to: "تاکنون",     // Present
                works: [],
            }
        ],
    },
]